In [1]:
from sqlalchemy import create_engine, text
import pandas as pd
import geopandas as gpd
import matplotlib.pyplot as plt
import folium
from folium.plugins import MarkerCluster
from folium.plugins import FastMarkerCluster
from shapely.geometry import Point

In [2]:
database_name = 'nashville_scooters'    # Fill this in with your database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

engine = create_engine(connection_string)

which company has the highest cost per minute? before pulling in information about how long the trips are, let's just take a look at the cost per min in the scooters table

In [3]:
query = '''
SELECT 
	companyname,
	AVG(costpermin) AS avg_costpermin,
	MAX(costpermin) AS max_costpermin,
	MIN(costpermin) AS min_costpermin
FROM scooters
GROUP BY companyname
ORDER BY avg_costpermin DESC
'''

with engine.connect() as connection:
    costpermin_by_company = pd.read_sql(text(query), connection)

In [4]:
costpermin_by_company

  companyname  avg_costpermin  max_costpermin  min_costpermin
0        Spin        0.211766            0.23            0.00
1        Bolt        0.166349            0.30            0.15
2      Gotcha        0.136374            0.15            0.00
3        Bird        0.114923            0.15            0.00
4        Lyft        0.113338            0.15            0.00
5        Lime        0.107924            0.23            0.00
6        Jump        0.059332            0.06            0.00

some scooters have a minimum costpermin that is 0. let's see what our df looks like if we say we only want to see the minimum when it's over 0.00. It'd be interesting to separate the ones that have a 0 cst permin and see what's up with those

In [5]:
query = '''
SELECT 
	companyname,
	AVG(costpermin) AS avg_costpermin,
	MAX(costpermin) AS max_costpermin,
	MIN(costpermin) AS min_costpermin
FROM scooters
WHERE costpermin > 0.00
    AND sumdgroup ILIKE 'scooter'
GROUP BY companyname
ORDER BY avg_costpermin DESC
'''

with engine.connect() as connection:
    costpermin_by_company = pd.read_sql(text(query), connection)

In [6]:
costpermin_by_company

  companyname  avg_costpermin  max_costpermin  min_costpermin
0        Spin        0.230000            0.23            0.23
1        Bolt        0.166349            0.30            0.15
2        Lime        0.151303            0.23            0.15
3      Gotcha        0.150000            0.15            0.15
4        Bird        0.150000            0.15            0.15
5        Lyft        0.150000            0.15            0.15
6        Jump        0.060000            0.06            0.06

Sorting by avg costpermin we see the order jump around a bit dropping off the 0 minimum prices. Spin has the highest avg cost per min, followed by Bolt. Bird,Spin, Lyft, Gotcha and Jump all have one set rate where Bolt and Lime have a min and a max.

I want to now see how many scooters are registered for each company -- I'm wondering if Bolt and Lime see less use which is why we have a rate that changes

In [7]:
query  = '''
SELECT companyname,
       COUNT (DISTINCT sumdid)
FROM scooters
WHERE sumdgroup ILIKE 'scooter'
    AND companyname = 'Spin'
GROUP BY companyname
'''

with engine.connect() as connection:
    scootcount_spin = pd.read_sql(text(query), connection)

In [8]:
scootcount_spin['total_scooters'] = scootcount_spin['count']

In [9]:
scootcount_spin = scootcount_spin.drop(columns = ['count'], axis = 1)
scootcount_spin

  companyname  total_scooters
0        Spin             805

In [10]:
scootcount_spin

  companyname  total_scooters
0        Spin             805

In [11]:
query  = '''
SELECT companyname,
       COUNT (DISTINCT sumdid)
FROM scooters
WHERE sumdgroup ILIKE 'scooter'
    AND companyname = 'Bolt'
GROUP BY companyname
'''

with engine.connect() as connection:
    scootcount_bolt = pd.read_sql(text(query), connection)

In [12]:
scootcount_bolt

  companyname  count
0        Bolt    360

In [13]:
scootcount_bolt.rename(columns = {'count':'total_scooters'}, inplace=True)
scootcount_bolt

  companyname  total_scooters
0        Bolt             360

In [14]:
scootcount_company = pd.concat([scootcount_spin, scootcount_bolt])
scootcount_company

  companyname  total_scooters
0        Spin             805
0        Bolt             360

In [15]:
query  = '''
SELECT companyname,
       COUNT (DISTINCT sumdid)
FROM scooters
WHERE sumdgroup ILIKE 'scooter'
    AND companyname = 'Bird'
GROUP BY companyname
'''

with engine.connect() as connection:
    scootcount_bird = pd.read_sql(text(query), connection)

scootcount_bird

  companyname  count
0        Bird   3860

In [16]:
scootcount_bird.rename(columns = {'count':'total_scooters'}, inplace=True)
scootcount_company = pd.concat([scootcount_company, scootcount_bird])
scootcount_company

  companyname  total_scooters
0        Spin             805
0        Bolt             360
0        Bird            3860

In [17]:
query  = '''
SELECT companyname,
       COUNT (DISTINCT sumdid)
FROM scooters
WHERE sumdgroup ILIKE 'scooter'
    AND companyname = 'Lime'
GROUP BY companyname
'''

with engine.connect() as connection:
    scootcount_lime = pd.read_sql(text(query), connection)

scootcount_lime

  companyname  count
0        Lime   1818

In [18]:
scootcount_lime.rename(columns = {'count':'total_scooters'}, inplace=True)
scootcount_company = pd.concat([scootcount_company, scootcount_lime])
scootcount_company

  companyname  total_scooters
0        Spin             805
0        Bolt             360
0        Bird            3860
0        Lime            1818

In [19]:
scootcount_company = scootcount_company.reset_index(drop=True)
scootcount_company

  companyname  total_scooters
0        Spin             805
1        Bolt             360
2        Bird            3860
3        Lime            1818

In [20]:
query  = '''
SELECT companyname,
       COUNT (DISTINCT sumdid)
FROM scooters
WHERE sumdgroup ILIKE 'scooter'
    AND companyname = 'Gotcha'
GROUP BY companyname
'''

with engine.connect() as connection:
    scootcount_gotcha = pd.read_sql(text(query), connection)


scootcount_gotcha.rename(columns = {'count':'total_scooters'}, inplace=True)
scootcount_company = pd.concat([scootcount_company, scootcount_gotcha])
scootcount_company

  companyname  total_scooters
0        Spin             805
1        Bolt             360
2        Bird            3860
3        Lime            1818
0      Gotcha             224

In [22]:
query  = '''
SELECT companyname,
       COUNT (DISTINCT sumdid)
FROM scooters
WHERE sumdgroup ILIKE 'scooter'
    AND companyname = 'Lyft'
GROUP BY companyname
'''

with engine.connect() as connection:
    scootcount_lyft = pd.read_sql(text(query), connection)


scootcount_lyft.rename(columns = {'count':'total_scooters'}, inplace=True)
scootcount_company = pd.concat([scootcount_company, scootcount_lyft])
scootcount_company

  companyname  total_scooters
0        Spin             805
1        Bolt             360
2        Bird            3860
3        Lime            1818
0      Gotcha             224
0        Lyft            1735

In [23]:
query  = '''
SELECT companyname,
       COUNT (DISTINCT sumdid)
FROM scooters
WHERE sumdgroup ILIKE 'scooter'
    AND companyname = 'Jump'
GROUP BY companyname
'''

with engine.connect() as connection:
    scootcount_jump = pd.read_sql(text(query), connection)


scootcount_jump.rename(columns = {'count':'total_scooters'}, inplace=True)
scootcount_company = pd.concat([scootcount_company, scootcount_jump])
scootcount_company

  companyname  total_scooters
0        Spin             805
1        Bolt             360
2        Bird            3860
3        Lime            1818
0      Gotcha             224
0        Lyft            1735
0        Jump            1210

In [25]:
scootcount_company = scootcount_company.reset_index(drop=True)
scootcount_company

  companyname  total_scooters
0        Spin             805
1        Bolt             360
2        Bird            3860
3        Lime            1818
4      Gotcha             224
5        Lyft            1735
6        Jump            1210

In [27]:
costpermin_count = costpermin_by_company.merge(scootcount_company, how='left', left_on = 'companyname', right_on = 'companyname',)
costpermin_count

  companyname  avg_costpermin  max_costpermin  min_costpermin  total_scooters
0        Spin        0.230000            0.23            0.23             805
1        Bolt        0.166349            0.30            0.15             360
2        Lime        0.151303            0.23            0.15            1818
3      Gotcha        0.150000            0.15            0.15             224
4        Bird        0.150000            0.15            0.15            3860
5        Lyft        0.150000            0.15            0.15            1735
6        Jump        0.060000            0.06            0.06            1210